tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "hashicorp/tap"
tap "cirruslabs/cli"

cask "raycast"
cask "hammerspoon"

brew "cirruslabs/cli/tart"
# brew "koekeishiya/formulae/yabai"
# brew "koekeishiya/formulae/skhd"

cask "visual-studio-code"
vscode "jnoortheen.nix-ide"
vscode "sumneko.lua"
vscode "timonwong.shellcheck"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "ms-playwright.playwright"
vscode "vue.vscode-typescript-vue-plugin"
vscode "WallabyJs.wallaby-vscode"
vscode "WallabyJs.quokka-vscode"

cask "hashicorp/tap/hashicorp-vagrant"
cask "parallels-virtualization-sdk"